	
	var issuelist={
		
		      "issue-order": [
	             {'wenti':'1.如何购买下单？','jieda':"答：下单操作步骤：1. 浏览您要购买的商品，点击'加入购物车'，商品会自动添加到购物车里；2. 如果您需要更改商品数量，需在商品数量框中输入购买数量；3.选好商品后点击'去结算'；4.详细填写收货人信息、发票信息，核对送货清单等信息；"},
	             {'wenti':'2.下单后可以修改订单吗？','jieda':'答：在订单未发货前之前可以修改，可直接联系在线客服，或者拨打客服电话：4001869797（修改订单可能影响送货时间）'},
	             {'wenti':'3.订单如何取消？','jieda':"答：取消未收货的订单，操作步骤如下：如订单处于暂停状态，进入'我的订单'页面，找到要取消的订单，点击'取消订单'按钮，备注取消原因等待审核退款即可。"},
	             {'wenti':'4.为什么我的订单总是无法提交成功？ ','jieda':"答：可能存在以下几种情况：（1）订单信息填写不完整；（2）订单商品库存不足或者库存无货；（3）订单商品不能配送到您所填写的收货地址；（4）网络延时；以上各种情况都会在页面中弹出提示信息，可以通过修改订单信息（提示信息）或者稍后再试，即可成功提交订单。"},
	             {'wenti':'5.为什么加入购物车后，去结算时价格发生变化?','jieda':'答:因为商品在促销时可能优惠力度比较大，造成抢购数超过限购数量，或促销结束时间到了，所以可能会出现结算时价格变高或变低。'},
	             {'wenti':'6.你们的品质是否有保障？','jieda':'答：挥货秉承认真负责的态度，对商品的产地、工艺、原材料都严格把关，力求帮消费者甄选到最优质的商品，请放心选购。'},
	             {'wenti':'7.实物与图片有色差吗？','jieda':'答：所有照片均以实物拍摄，颜色经设计师校对，由于不同的电脑显示器、光线、亮度都有差异，造成轻微色差难以避免。'},
	             {'wenti':'8.订单生成后我需要在多长时间内支付货款？','jieda':'答：下单后我们会为您保留30分钟，为确保订单的有效性，需要您在30分钟内完成支付。'},
	             {'wenti':'9.在线支付已经成功，为什么我的订单状态还是显示“待付款”？','jieda':'答：一般来说，网上支付是即时到账的。但有时因为网络原因，可能会有几分钟的延迟，请您耐心等待，并及时查询您的银行卡账户余额，如果费用已扣，但订单状态依然是“未付款”，请联系客服处理。'},
	             {'wenti':'10.支付方式有哪些？如何支付？','jieda':'答：    支持在线支付，请您进入“我的订单”，点击“付款”，按提示进行操作；目前在线支付支持银行卡、微信、信用卡、支付宝等方式进行支付，具体请以支付页面信息为准，您可根据您的使用喜好进行选择。'}
	         ],
		       "issue-logistics": [
	             {'wenti':'11.你们是用什么快递？','jieda':'答：一般情况下，我们采用京东快递，保证产品运输品质；由第三方商家发货的订单，按照商家提供快递进行配送，如您有特殊需求，可以联系商家协商发货快递。'},
	             {'wenti':'12.如何查询物流信息？','jieda':'答：您可以进入“我的订单”点击对应订单查询即可看到物流更新；'},
	             {'wenti':'13.我的产品多长时间能送到？','jieda':'答：正常订单我们会在订单支付成功后3天内发货（节假日顺延），送达时间视快递配送时间而定。预售产品将会按照页面标识发货时间为准。'},
	             {'wenti':'14.如何免运费？','jieda':'答：对于单笔所购商品总价金额（不含运费）大于或等于xx元，可免收配送费。'},
	             {'wenti':'15.为什么查不到我购买的商品的配送信息/物流信息？','jieda':'答：配送信息将在订单发出后开始更新，若长时间未更新物流信息，请联系客服为您处理。'}
	         ],
	        "issue-sale": [
	             {'wenti':'16.收到商品不是自己购买的如何处理？','jieda':'答：商品收到时，请先仔细核对清单，若与清单不符，请直接联系客服人员为您处理。'},
	             {'wenti':'17.商品验货与签收','jieda':'答：为了保证顾客的利益，请顾客在收到货物时务必验货，请拆开包装箱，确认货品完好无损后再签收。如果发现货物（除生鲜产品）在运输途中有破损，顾客有权拒收，在快递单上写明拒收原因，请配送人员退回。若发现商品有缺件或丢件，请在签收时间24小时内联系客服处理。超过24小时，挥货概不负责。'},
	             {'wenti':'18.收到商品查验已破损，拒收后如何申请退款？','jieda':'答：签收商品时，建议您当着快递员的面验货，若商品存在问题，请拍照后拒收，并及时在线联系卖家/客服提供证明文件，等待商品返回至卖家签收后，在挥货个人中心——我的订单中申请取消订单退款。'},
	             {'wenti':'19.退货运费由谁负责？','jieda':"答：1、因商品质量问题、第三方物流及挥货本身的原因产生的退货，退货运费由挥货平台承担。2、因顾客原因产生的退货，退货运费由顾客个人承担。（注：不支持货到付款业务，请顾客先垫付运费，并将运单一并寄回。到货验证商品后，挥货将以现金券形式为用户报销运费。如果是未经确认而擅自退回的商品，该退货申请将不被受理。此时商品将通过平邮方式退还给顾客，按原地址返回的运费由顾客承担。）"},
	             {'wenti':'20.请问如何联系到给我送货的快递员？','jieda':'答：挥货产品配送采用京东快递，当您的订单分配给具体配送员并已出发配送，在物流信息中就会显示配送员联系电话。'},
	             {'wenti':'21.订购的生鲜是否可以拒收？','jieda':'答：非常抱歉，生鲜商品属于鲜活易腐类特殊商品，暂不支持拒收，如您收货时发现问题，为尽快处理您的问题，请及时在线联系卖家/客服提供照片等证明文件，进行售后处理'},
	             {'wenti':'22.我的退款会给我退到哪里？','jieda':'答：退款将原路返还，不同的银行处理时间不同，预计1-5个工作日内到账。若您在该订单中使用过优惠券，则该优惠券不予返还，并按 "券后结算价"为商品退款。'},
	             {'wenti':'23.收到货后是否需要需要确认订单？','jieda':'答：所有订单无需您点击确认收货，系统配送完成后会自动完成。温馨提示：如订单未收到货/出现异常，请联系客服处理。'},
	             {'wenti':'24.客服的联系方式是什么？','jieda':'答：您可以通过在线客服和电话联系客服。客服电话:4001869797'},
	             {'wenti':'25.在哪里查看我的优惠券？','jieda':'答：登录 挥货“个人中心-优惠券”中可查看您的优惠券，包括未使用、已使用、未过期优惠券。'}
	         ],
	         "issue-lianxi": [  
	                         {'wenti':'26.我该如何联系挥货客服？','jieda':'答： </br> 客服电话:</br>4001869797 </br> 0755-82986161 </br> 0755-82986162  </br> 客服微信:huihuokefu </br> huihuokefu123 '},    
	       	         ]
	          
	}
		$(function(){
			$('.issueList label').click(function(){
				var $index=$(this).index();
				$(this).siblings('.child').toggle();
				var key=$(this).attr('data');
				var list=issuelist[key];
				$(this).siblings('.child').empty();
				for(var i in list){
					showissue(i,list[i].wenti,$(this).siblings('.child'));
				}
			});
			$(document).on('click','.issueList .child i',function(){	
				var key=$(this).parents('.child').siblings('label').attr('data');
				var list=issuelist[key];
				var i=$(this).attr('num');
				var data=list[i];
				createDia(data.wenti,data.jieda);
			});
			function showissue(i,iCon,obj){
				var oi='<i num='+i+'>'+iCon+'</i>';
				obj.append(oi);
			}
			function createDia(userCon,serviceCon){
				var obj='<li class="separate"></li>'+
						'<li class="user">'+
							'<div class="portrait"><img src="'+resourcePath+'/weixin/img/diauser.png" alt="" /></div>'+
							'<div class="infos">'+userCon+'</div>'+
							'<span></span>'+
						'</li>'+
						'<li class="separate"></li>'+
						'<li class="service">'+
							'<div class="portrait"><img src="'+resourcePath+'/weixin/img/diahui.png" alt="" /></div>'+
							'<div class="infos">'+
								serviceCon+
							'</div>'+
							'<span></span>'+
						'</li>';
				$('.msglsists').append(obj);
		//		发送消息固定在当前位置
				var oli=document.getElementsByClassName('msglsists')[0].lastChild;
				oli.scrollIntoView();
			}
			
		});
		